'use strict';

// 1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

console.log(`\n\n1. Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).\n`);

let res1 = '';

for (let i = 20; i <= 30; i += 0.5) {
    res1 += `${i} `;
}

console.log(res1);


// 2. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

console.log(`\n\n2. Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.\n`);

for (let i = 10; i <= 100; i += 10) {
    console.log(`При курсі 27 гривень за долар, ${i} доларів коштують ${i * 27} гривень`)
}

// 3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

let n = 2500;
console.log(`\n\n3. Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N (N = ${n}).\n`);

let res2 = '';

for (let i = 1; i <= 100; i++) {
    if (i ** 2 <= n) {
        res2 += `${i}, `
    } else break;
}

console.log(res2.slice(0, -2)+`.`);


// 4. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

let num = 40;
console.log(`\n\n4. Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе). В даному випадку перевіряємо число ${num}.\n`)

let count = 0;
let res3 = '';

for (let i = 2; i < num; i++) {
    if (!(num % i)) {
        count ++;
        res3 += `${i}, `
    }
}

(!count) ? console.log(`Число ${num} є простим числом`) : console.log(`Число ${num} не є простим числом. Його дільниками, окрім 1 та ${num}, є: ${res3.slice(0, -2)+`.`}`);


// 5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let num1 = 14348907;
console.log(`\n\n5. Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна). В даному випадку перевіряємо число ${num1}.\n`)

let power = 0;

for (let i = 2; i <= (num1 / 3); i++) {
    if (3 ** i === num1) {
        power = i;
        break;
    }
}

if (num1 === 3){
    console.log(`Число ${num1} - це 3 в ступені 1.`);
} else if (num1 === 1) {
    console.log(`Число ${num1} - це 3 в ступені 0.`);
} else if (!power) {
    console.log(`Число ${num1} не можна одержати шляхом зведення числа 3 у деякий ступінь.`);
} else console.log(`Число ${num1} - це 3 в ступені ${power}`);
